app/controllers/articles_controller.rb

  def create
    # First Way:
    # @article = Article.new
    # @article.title = params[:article][:title]
    # @article.body = params[:article][:body]

    # Second Way:
    # @article = Article.new(
    #     title: params[:article][:title],
    #     body: params[:article][:body])

    # Third Way:
    # @article = Article.new(params[:article])
    # adding security permisions:
    @article = Article.new(article_params)

    @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My First Rails Article with Body"], ["body", "Testing Testing"], ["created_at", "2018-04-10 13:55:48.944548"], ["updated_at", "2018-04-10 13:55:48.944548"]]

  def update
    @article = Article.find(params[:id])

    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "bugfix.jpeg"], ["image_file_size", 35807], ["image_updated_at", "2018-04-11 13:48:31.893656"], ["updated_at", "2018-04-11 13:48:31.905623"], ["id", 10]]